import 'package:flutter/material.dart';

final themaCafe={'배경색': '#FAF8F5', '어플상하단색': '#D1BEA5',
  '어플상하단글씨':'#4C3825', '아이콘':'#4C3825',
  '달력상단':'#4C3825', '달력요일글씨':'#4C3825',
  'SELECTED':'#7A3815','TODAY':'#7A3815',
  '달력일기쓴날':'#D1BEA5', '달력하단날짜':'#4C3825',
  '상세보기':'#4C3825', '대화창말풍선':'#D1BEA5',
  '대화창글씨':'#4C3825', '버튼글씨':'#4C3825',
  '버튼테두리':'#D1BEA5', '버튼배경색':'#FAF8F5'
};
final themaSantorini={'배경색': '#FFFFFF', '어플상하단색': '#D1BEA5',
  '어플상하단글씨':'#4C3825', '아이콘':'#4C3825',
  '달력상단':'#4C3825', '달력요일글씨':'#4C3825',
  'SELECTED':'#7A3815','TODAY':'#7A3815',
  '달력일기쓴날':'#D1BEA5', '달력하단날짜':'#4C3825',
  '상세보기':'#4C3825', '대화창말풍선':'#D1BEA5',
  '대화창글씨':'#4C3825', '버튼글씨':'#4C3825',
  '버튼테두리':'#D1BEA5', '버튼배경색':'#FAF8F5'
};
final themaRetro={'배경색': '#FFFDF2', '어플상하단색': '#FFDB0A',
  '어플상하단글씨':'#537C24', '아이콘':'#537C24',
  '달력상단':'#7A3815', '달력요일글씨':'#7A3815',
  'SELECTED':'#537C24','TODAY':'#537C24',
  '달력일기쓴날':'#FFDB0A', '달력하단날짜':'#FFDB0A',
  '상세보기':'#FFDB0A', '대화창말풍선':'#D1BEA5',
  '대화창글씨':'#4C3825', '버튼글씨':'#4C3825',
  '버튼테두리':'#D1BEA5', '버튼배경색':'#FAF8F5'
};
final themaMono={'배경색': '#FFFFFF', '어플상하단색': '#D1BEA5',
  '어플상하단글씨':'#4C3825', '아이콘':'#4C3825',
  '달력상단':'#4C3825', '달력요일글씨':'#4C3825',
  'SELECTED':'#7A3815','TODAY':'#7A3815',
  '달력일기쓴날':'#D1BEA5', '달력하단날짜':'#4C3825',
  '상세보기':'#4C3825', '대화창말풍선':'#D1BEA5',
  '대화창글씨':'#4C3825', '버튼글씨':'#4C3825',
  '버튼테두리':'#D1BEA5', '버튼배경색':'#FAF8F5'
};
final themaPop={'배경색': '#FFFFFF', '어플상하단색': '#D1BEA5',
  '어플상하단글씨':'#4C3825', '아이콘':'#4C3825',
  '달력상단':'#4C3825', '달력요일글씨':'#4C3825',
  'SELECTED':'#7A3815','TODAY':'#7A3815',
  '달력일기쓴날':'#D1BEA5', '달력하단날짜':'#4C3825',
  '상세보기':'#4C3825', '대화창말풍선':'#D1BEA5',
  '대화창글씨':'#4C3825', '버튼글씨':'#4C3825',
  '버튼테두리':'#D1BEA5', '버튼배경색':'#FAF8F5'
};
final themaColorList = <String,Map>{
  '카페':themaCafe,
  '산토리니':themaSantorini,
  '레트로':themaRetro,
  '모노톤':themaMono,
  '파스텔 팝':themaPop
};

// final List colorList = [
//
//   ['#FFFDF2','#D1BEA5','#7A3815','#4C3825'],
//   ['#FFFDF2','#FFDB0A','#537C24','#7A3815'],
//   ['#FFFFFF','#B6C7F2','#597CD0'],
//   ['#E1E1E1','#6E6E6E','#9D1E14','#000000'],
//   ['#FCF7D9','#FCE0D9','#DCF5F7','#361E10','#ED585F','#58DEED']
// ] ;

